# IncludeFirstBar Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..IncludeFirstBar Property
RebarContainerItem Class See Also
---
Identifies if the first bar in rebar set is shown.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IncludeFirstBar { get; set; }
```

Visual Basic
---
```text
Public Property IncludeFirstBar As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IncludeFirstBar {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace